test_results_20251018_190234/ab_balance_results.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking api.baiyi-pay.com (be patient).....done


Server Software:        nginx/1.22.1
Server Hostname:        api.baiyi-pay.com
Server Port:            443
SSL/TLS Protocol:       TLSv1.2,ECDHE-ECDSA-CHACHA20-POLY1305,256,256
Server Temp Key:        ECDH X25519 253 bits
TLS Server Name:        api.baiyi-pay.com

Document Path:          /api/v1/merchant/balance
Document Length:        82 bytes

Concurrency Level:      10
Time taken for tests:   5.342 seconds
Complete requests:      100
Failed requests:        99
   (Connect: 0, Receive: 0, Length: 99, Exceptions: 0)
Non-2xx responses:      3
Total transferred:      52252 bytes
Total body sent:        34300
HTML transferred:       6304 bytes
Requests per second:    18.72 [#/sec] (mean)
Time per request:       534.233 [ms] (mean)
Time per request:       53.423 [ms] (mean, across all concurrent requests)
Transfer rate:          9.55 [Kbytes/sec] received
                        6.27 kb/s sent
                        15.82 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:      121  324 368.4    244    3447
Processing:    46  100  76.5     86     535
Waiting:       45   79  35.3     72     368
Total:        167  424 393.8    335    3558

Percentage of the requests served within a certain time (ms)
  50%    335
  66%    415
  75%    453
  80%    481
  90%    568
  95%    980
  98%   1794
  99%   3558
 100%   3558 (longest request)