test_results_20251018_190234/ab_create_results.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking api.baiyi-pay.com (be patient).....done


Server Software:        nginx/1.22.1
Server Hostname:        api.baiyi-pay.com
Server Port:            443
SSL/TLS Protocol:       TLSv1.2,ECDHE-ECDSA-CHACHA20-POLY1305,256,256
Server Temp Key:        ECDH X25519 253 bits
TLS Server Name:        api.baiyi-pay.com

Document Path:          /api/v1/order/create
Document Length:        94 bytes

Concurrency Level:      10
Time taken for tests:   7.789 seconds
Complete requests:      100
Failed requests:        99
   (Connect: 0, Receive: 0, Length: 99, Exceptions: 0)
Non-2xx responses:      4
Total transferred:      52008 bytes
Total body sent:        57700
HTML transferred:       6344 bytes
Requests per second:    12.84 [#/sec] (mean)
Time per request:       778.943 [ms] (mean)
Time per request:       77.894 [ms] (mean, across all concurrent requests)
Transfer rate:          6.52 [Kbytes/sec] received
                        7.23 kb/s sent
                        13.75 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:      125  622 564.5    317    2295
Processing:    47   99  44.8     91     371
Waiting:       46   87  42.5     80     371
Total:        175  721 569.9    433    2395

Percentage of the requests served within a certain time (ms)
  50%    433
  66%    577
  75%   1303
  80%   1351
  90%   1513
  95%   1719
  98%   2356
  99%   2395
 100%   2395 (longest request)