test_results_20251018_190234/ab_query_results.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking api.baiyi-pay.com (be patient).....done


Server Software:        nginx/1.22.1
Server Hostname:        api.baiyi-pay.com
Server Port:            443
SSL/TLS Protocol:       TLSv1.2,ECDHE-ECDSA-CHACHA20-POLY1305,256,256
Server Temp Key:        ECDH X25519 253 bits
TLS Server Name:        api.baiyi-pay.com

Document Path:          /api/v1/order/query
Document Length:        82 bytes

Concurrency Level:      10
Time taken for tests:   4.405 seconds
Complete requests:      100
Failed requests:        99
   (Connect: 0, Receive: 0, Length: 99, Exceptions: 0)
Non-2xx responses:      3
Total transferred:      52252 bytes
Total body sent:        38300
HTML transferred:       6304 bytes
Requests per second:    22.70 [#/sec] (mean)
Time per request:       440.534 [ms] (mean)
Time per request:       44.053 [ms] (mean, across all concurrent requests)
Transfer rate:          11.58 [Kbytes/sec] received
                        8.49 kb/s sent
                        20.07 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:      125  306 222.3    246    1588
Processing:    48   98  59.8     84     505
Waiting:       46   79  33.5     73     279
Total:        181  404 237.6    335    1683

Percentage of the requests served within a certain time (ms)
  50%    335
  66%    418
  75%    463
  80%    548
  90%    615
  95%    799
  98%   1345
  99%   1683
 100%   1683 (longest request)