test_results_20251018_190234/stress_create_results.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking api.baiyi-pay.com (be patient)


Server Software:        nginx/1.22.1
Server Hostname:        api.baiyi-pay.com
Server Port:            443
SSL/TLS Protocol:       TLSv1.2,ECDHE-ECDSA-CHACHA20-POLY1305,256,256
Server Temp Key:        ECDH X25519 253 bits
TLS Server Name:        api.baiyi-pay.com

Document Path:          /api/v1/order/create
Document Length:        62 bytes

Concurrency Level:      50
Time taken for tests:   7.032 seconds
Complete requests:      500
Failed requests:        51
   (Connect: 0, Receive: 0, Length: 51, Exceptions: 0)
Non-2xx responses:      51
Total transferred:      251944 bytes
Total body sent:        288500
HTML transferred:       32428 bytes
Requests per second:    71.10 [#/sec] (mean)
Time per request:       703.233 [ms] (mean)
Time per request:       14.065 [ms] (mean, across all concurrent requests)
Transfer rate:          34.99 [Kbytes/sec] received
                        40.06 kb/s sent
                        75.05 kb/s total

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:      122  383 336.6    256    2137
Processing:    44  142 138.3     88     846
Waiting:       44   91  85.1     72     830
Total:        167  525 395.2    367    2402

Percentage of the requests served within a certain time (ms)
  50%    367
  66%    498
  75%    661
  80%    810
  90%   1119
  95%   1356
  98%   1711
  99%   2123
 100%   2402 (longest request)